__name__ = 'EternalSpider'
__version__ = '3.0.1'
__author__ = 'Turporfo'

__describe__ = '''
2024.6.17: v1.0正式圆满结束, 可能存在bug, 
           但不影响使用.

2024.6.21: v1.1修复了日志不明确且多余的bug
           与增添下载进度条.

2024.6.30: v1.2初步实现对于网易云音乐的爬取.

2024.7.12: v1.3简单优化了kugou api的异常处理逻辑.

2024.7.12: v2.0优化了kugou api，新增了对于网易云的支持.

2024.7.13: v2.1修复了歌曲页数，Mv，歌曲每页大小无法正确返回的问题
           优化了文档注释.

2024.7.14: v2.2优化了代码中存在的bug.

2024.7.18: v2.3优化了代码中存在的bug.

2024.8.11: v2.3.1删除了尚不完善的网易云模块

2024.8.25: v2.3.2初步优化的进度条显示问题以及日志打印

2024.8.26: v2.3.3优化了一些bugs

2024.9.1:  v2.3.4优化了日志的显示问题。

2024.9.22: v2.3.5整体优化冗余代码,新增酷我音乐解析支持

2024.9.23: v2.3.6优化了一些存在的bugs,更新了对酷我歌单的支持,
           但仍存下载不准确问题

2024.9.28: v2.4.0支持酷我音乐的大多数下载,尝试进一步优化冗余代码中

2024.10.5: v2.6.0优化部分冗余代码,尝试重写原函数与代码结构

2024.10.6: v3.0.1支持酷我酷狗音乐,但有部分bug

'''


